# Начав тренировки, лыжник в первый день пробежал 10 км.
# Каждый следующий день он увеличивал пробег на 10% от пробега предыдущего дня.
# Определите:
# а) пробег лыжника за второй, третий, ..., десятый день тренировок;
# б) какой суммарный путь он пробежал за первые 7 дней тренировок.
# в) суммарный путь за n дней тренировок;
# г) в какой день ему следует прекратить увеличивать пробег, если он не должен превышать 80 км?

def universalLoop(trip, n = 0):
    sum = trip
    for i in range(n):
        trip = trip + trip / 10
        sum = sum + trip
    return sum

def dayTrip(trip):
    for day in range(2, 11):
        trip = trip + trip / 10
        print("Пробег за", day, "день тренировок:", round(trip, 2))

def stopRun(trip, day = 1):
    while (True):
        trip = trip + trip / 10
        day = day + 1
        if trip >= 80:
            print("Должен увеличивать пробег на", day, "день")
            break
def credits():
    print('''
       :\     /;               _
      ;  \___/  ;             ; ;
     ,:-"'   `"-:.            / ;
_   /,---.   ,---.\   _     _; /
_:>((  |  ) (  |  ))<:_ ,-""_,"
    \`````   `````/""""",-""
     '-.._ v _..-'      )
       / ___   ____,..  )
      / /   | |   | ( \ \ 
ctr  / /    | |    | |  \ \ 
     `"     `"     `"    `"
     
     Made by [holmsya].
     ''')

firstDayTrip = 10
#----а-------------------------------------------------------------------
dayTrip(firstDayTrip)
#----б-------------------------------------------------------------------
print("Пробег за 7 дней:", round(universalLoop(firstDayTrip, 6), 2))
#----в-------------------------------------------------------------------
n = int(input("Введите количество дней тренировок:"))
sumTrip = universalLoop(firstDayTrip, n-1)
print("Пробег за", n, "дней:", round(sumTrip, 2))
#----г-------------------------------------------------------------------
stopRun(firstDayTrip)
credits()